Revit 2026 API

# EnergyDataSettingsShadeDepth Property

---

Used for the conceptual energy model. Amount that auto-generated shading will extend from auto-generated windows.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ShadeDepth { get; set; }
```
```vb
Public Property ShadeDepth As Double
	Get
	Set
```
```cpp
public:
property double ShadeDepth {
	double get ();
	void set (double value);
}
```
```fsharp
member ShadeDepth : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The shade depth is less than zero. |

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace